app/Http/Controllers/registro/fixo.php

select * from `registro_fixo`
---
    public function index() {
        $registros = RegistroFixo::all();