app/Http/Controllers/Registro/FixoController.php

select * from `registro_fixo` order by `nm_registroFixo` asc limit 9 offset 0
select count(*) as aggregate from `registro_fixo`
---
    public function index()
    {
        $registros = RegistroFixo::orderBy('nm_registroFixo')->paginate(9);

select * from `nivel_imp`
select * from `tipo_registro`
select * from `forma_pagamento`
select * from `metodo_pagamento`
select * from `categoria`
select * from `localizacao`
---
    public function create()
    {
        return view("registro.fixo.create", [
            "tipos" => Tipo::all(),
            "formas" => FormaPagamento::all(),
            "metodos" => MetodoPagamento::all(),
            "importancias" => Nivel_imp::all(),
            "categorias" => Categoria::all(),
            "localizacaos" => Localizacao::all(),
            "realizadores" => Realizador::all(),
        ]);

select * from `forma_pagamento`
select * from `metodo_pagamento`
select * from `nivel_imp`
select * from `categoria`
select * from `localizacao`
---
    public function edit(int $id)
    {
        return view("registro.fixo.edit",[
            "registro" => RegistroFixo::find($id),
            "tipos" => Tipo::all(),
            "formas" => FormaPagamento::all(),
            "metodos" => MetodoPagamento::all(),
            "importancias" => Nivel_imp::all(),
            "categorias" => Categoria::all(),
            "localizacaos" => Localizacao::all(),