app/Http/Controllers/registro/fixo.php

    public function create() {
        return view("registro.fixo.create",[
            "tipos" => Tipo::all(),
            "formas" => FormaPagamento::all(),
            "metodos" => MetodoPagamento::all(),
            "importancias" => Nivel_imp::all(),
            "categorias" => Categoria::all(),
            "localizacaos" => Localizacao::all(),
            "realizadores" => Realizador::all(),
        ]);
---
select * from `metodo_pagamento`
select * from `forma_pagamento`
select * from `tipo_registro`